Revit 2026 API

# SelectionPickBox(PickBoxStyle, String) Method

---

Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen.

**Namespace:** Autodesk.Revit.UI.Selection**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PickedBox PickBox(
	PickBoxStyle style,
	string statusPrompt
)
```
```vb
Public Function PickBox (
	style As PickBoxStyle,
	statusPrompt As String
) As PickedBox
```
```cpp
public:
PickedBox^ PickBox(
	PickBoxStyle style,
	String^ statusPrompt
)
```
```fsharp
member PickBox :
        style : PickBoxStyle *
        statusPrompt : string -> PickedBox
```

#### Parameters

style PickBoxStyle
    Specifies the value that controls the style of the pick box.
statusPrompt String
    The message shown on the status bar.

#### Return Value

PickedBoxThe picked box that contains two XYZ points.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Thrown when the style is not a recognized value. |
| ArgumentNullException | Thrown when the argument statusPrompt is . |
| OperationCanceledException | Thrown when the Revit user cancelled this operation. Thrown when the Revit user tried to switch the active view, close the active document or Revit application when responding to this mode. |

The method starts an editor and returns when it finishes. Returns a PickedBox that contains two XYZ points.

#### Reference

Selection Class

PickBox Overload

Autodesk.Revit.UI.Selection Namespace